app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "sfs"], ["title", "sdfs"], ["url", "sdfsdf"], ["created_at", 2017-07-18 19:09:58 UTC], ["updated_at", 2017-07-18 19:09:58 UTC]]
---
  def create

    @picture = Picture.new
    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save